In [1]:
import pandas as pd
import numpy as np

# read CSV Profesi.csv

In [2]:
df = pd.read_csv('profesi.csv', delimiter='|')
df.head()
df.tail()

     user_id  age gender     occupation zip_code
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

### 2.1 Ada berapa jenis profesi yang ada dalam dataset tersebut? Sebutkan!

In [3]:
nProfesi = df.occupation.nunique()
nProfesi
print(f"ada {nProfesi} jenis profesi dalam dataset")

ada 21 jenis profesi dalam dataset

In [4]:
macamProfesi = list(df.occupation.unique())
macamProfesi
print(f"Daftar profesinya adalah : {macamProfesi}")

Daftar profesinya adalah : ['technician', 'other', 'writer', 'executive', 'administrator', 'student', 'lawyer', 'educator', 'scientist', 'entertainment', 'programmer', 'librarian', 'homemaker', 'artist', 'engineer', 'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor']

### 2.2. Buatlah sebuah dataframe yang menunjukkan data usia maksimal, minimal & rata-ratanya, berdasarkan profesi & gender!

In [5]:
dfc = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                            'two'],
                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                    'baz': [1, 2, 3, 4, 5, 6],
                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

dfc
dfc.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

### Memisahkan data Female dan Male

In [6]:
dfMale = df[df['gender']=='M']
print("jumlah gender MALE",len(dfMale))

jumlah gender MALE 670

In [7]:
dfFemale = df[df.gender == 'F']
print("jumlah gender FEMALE",len(dfFemale))

jumlah gender FEMALE 273

### hitung data pergender berdasarkan PEKERJAAN

In [8]:
df1 = dfMale.groupby("occupation").count()['gender']
print(df1)
df2 = dfFemale.groupby("occupation").count()['gender']
print(df2)

occupation
administrator     43
artist            15
doctor             7
educator          69
engineer          65
entertainment     16
executive         29
healthcare         5
homemaker          1
lawyer            10
librarian         22
marketing         16
none               5
other             69
programmer        60
retired           13
salesman           9
scientist         28
student          136
technician        26
writer            26
Name: gender, dtype: int64
occupation
administrator    36
artist           13
educator         26
engineer          2
entertainment     2
executive         3
healthcare       11
homemaker         6
lawyer            2
librarian        29
marketing        10
none              4
other            36
programmer        6
retired           1
salesman          3
scientist         3
student          60
technician        1
writer           19
Name: gender, dtype: int64

In [30]:
dfJawab = pd.DataFrame(df1)
dfJawab = dfJawab.rename(columns={"gender": "n male"})
dfJawab

               n male
occupation
administrator      43
artist             15
doctor              7
educator           69
engineer           65
entertainment      16
executive          29
healthcare          5
homemaker           1
lawyer             10
librarian          22
marketing          16
none                5
other              69
programmer         60
retired            13
salesman            9
scientist          28
student           136
technician         26
writer             26

In [47]:
dfJawab2 = pd.DataFrame(df2)
dfJawab2 = dfJawab2.rename(columns={"gender": "n female"})
# dfJawab2

dfJawab['n female'] = dfJawab2['n female']
dfJawab = dfJawab.fillna(0)

dfJawab['total'] = dfJawab['n male'] + dfJawab['n female']
dfJawab

               n male  n female  total
occupation
administrator      43      36.0   79.0
artist             15      13.0   28.0
doctor              7       0.0    7.0
educator           69      26.0   95.0
engineer           65       2.0   67.0
entertainment      16       2.0   18.0
executive          29       3.0   32.0
healthcare          5      11.0   16.0
homemaker           1       6.0    7.0
lawyer             10       2.0   12.0
librarian          22      29.0   51.0
marketing          16      10.0   26.0
none                5       4.0    9.0
other              69      36.0  105.0
programmer         60       6.0   66.0
retired            13       1.0   14.0
salesman            9       3.0   12.0
scientist          28       3.0   31.0
student           136      60.0  196.0
technician         26       1.0   27.0
writer             26      19.0   45.0

### 2.3 Buatlah sebuah dataframe yang menunjukkan persentase pria & wanita tiap profesi!

In [54]:
dfPersen = pd.DataFrame()

dfPersen['%male'] = dfJawab.iloc[:,0] / dfJawab.iloc[:,2] * 100
dfPersen['%female'] = dfJawab.iloc[:,1] / dfJawab.iloc[:,2] * 100
dfPersen['%total'] = dfJawab.iloc[:,2] / dfJawab.iloc[:,2] * 100

dfPersen

                    %male    %female  %total
occupation
administrator   54.430380  45.569620   100.0
artist          53.571429  46.428571   100.0
doctor         100.000000   0.000000   100.0
educator        72.631579  27.368421   100.0
engineer        97.014925   2.985075   100.0
entertainment   88.888889  11.111111   100.0
executive       90.625000   9.375000   100.0
healthcare      31.250000  68.750000   100.0
homemaker       14.285714  85.714286   100.0
lawyer          83.333333  16.666667   100.0
librarian       43.137255  56.862745   100.0
marketing       61.538462  38.461538   100.0
none            55.555556  44.444444   100.0
other           65.714286  34.285714   100.0
programmer      90.909091   9.090909   100.0
retired         92.857143   7.142857   100.0
salesman        75.000000  25.000000   100.0
scientist       90.322581   9.677419   100.0
student         69.387755  30.612245   100.0
technician      96.296296   3.703704   100.0
writer          57.777778  42.222222   100.0